<a href="https://colab.research.google.com/github/sameersami07/Basicmachinelearning/blob/main/assignment2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 1.Create a Pandas DataFrame from the following dictionary:
data = {
 'Name': ['Alice', 'Bob', 'Carol'],
 'Age': [24, 27, 22],
 'Salary': [50000, 55000, 48000]
}

• Add a new column called Bonus which is 10% of the salary.

In [3]:
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Carol'],
    'Age': [24, 27, 22],
    'Salary': [50000, 55000, 48000]
}
df=pd.DataFrame(data)
df['Bonus']=df['Salary']*0.10
print(df)

    Name  Age  Salary   Bonus
0  Alice   24   50000  5000.0
1    Bob   27   55000  5500.0
2  Carol   22   48000  4800.0

# 2.Given the DataFrame created in the above question:

• Display the first two rows.

• Compute the mean salary.

In [6]:
first_two_rows=df.head(2)
print("first two rows:")
print(first_two_rows)
mean_salary=df['Salary'].mean()
print("\nmean salary :",mean_salary)

first two rows:
    Name  Age  Salary   Bonus
0  Alice   24   50000  5000.0
1    Bob   27   55000  5500.0

mean salary : 51000.0

 # 3.Using the same DataFrame:

• Extract all rows where the Age is greater than 25.

• Filter out rows where the Salary is less than 50000

In [7]:
age_greaterthan25=df[df['Age']>25]
print("age greater than 25 rows:")
print(age_greaterthan25)
sal_lessthan50000=df[df['Salary']<50000]
print("\nsalary less than 50000 rows:")
print(sal_lessthan50000)

age greater than 25 rows:
  Name  Age  Salary   Bonus
1  Bob   27   55000  5500.0

salary less than 50000 rows:
    Name  Age  Salary   Bonus
2  Carol   22   48000  4800.0

#4. Create the following DataFrame:
data = {
 'A': [1, 2, None, 4],
 'B': [None, 2, 3, None],
 'C': [1, 2, 3, 4]
}
df = pd.DataFrame(data)

• Fill missing values in column A with the mean of the column.

• Drop rows where all values are None.

In [9]:
data = {
    'A': [1, 2, None, 4],
    'B': [None, 2, 3, None],
    'C': [1, 2, 3, 4]
}
df = pd.DataFrame(data)
df.fillna({'A': df['A'].mean()}, inplace=True)
df_dropped=df.dropna(how='all')
print("DataFrame after filling missing values in column A:")
print(df)
print("\nDataFrame after dropping rows where all values are None:")
print(df_dropped)

DataFrame after filling missing values in column A:
          A    B  C
0  1.000000  NaN  1
1  2.000000  2.0  2
2  2.333333  3.0  3
3  4.000000  NaN  4

DataFrame after dropping rows where all values are None:
          A    B  C
0  1.000000  NaN  1
1  2.000000  2.0  2
2  2.333333  3.0  3
3  4.000000  NaN  4

# 5. Create a DataFrame for employees:
data = {
 'Department': ['HR', 'HR', 'IT', 'IT', 'Finance'],
 'Employee': ['Alice', 'Bob', 'Carol', 'David', 'Eve'],
 'Salary': [50000, 45000, 60000, 65000, 70000]
}

• Group the data by Department and compute the total and mean salary for each
department.

In [16]:
data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance'],
    'Employee': ['Alice', 'Bob', 'Carol', 'David', 'Eve'],
    'Salary': [50000, 45000, 60000, 65000, 70000]
}
df = pd.DataFrame(data)
grouped=df.groupby('Department')['Salary'].agg(['sum','mean']).rename(columns={'sum':'Total Salary','mean':'Mean Salary'})
print(grouped)

            Total Salary  Mean Salary
Department
Finance            70000      70000.0
HR                 95000      47500.0
IT                125000      62500.0

#6. Given two DataFrames:
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Carol']})

df2 = pd.DataFrame({'ID': [2, 3, 4], 'Age': [25, 30, 22]})

• Perform an inner join on the ID column.

In [18]:
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Carol']})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Age': [25, 30, 22]})
inner_df=pd.merge(df1,df2,on='ID',how='inner')
print(inner_df)

   ID   Name  Age
0   2    Bob   25
1   3  Carol   30

#7. Given a small dataset, clean and display basic statistics using Pandas.

In [20]:
data = {
    'Name': ['Alice', 'Bob', 'Carol', 'David', 'Eve'],
    'Age': [24, 27, None, 22, 30],
    'Salary': [50000, 55000, 48000, None, 70000]
}
df = pd.DataFrame(data)
df.fillna({'Age': df['Age'].mean(), 'Salary': df['Salary'].mean()}, inplace=True)
df.dropna(subset=['Name'], inplace=True)
statistics = df.describe()
print("Cleaned DataFrame:")
print(df)

print("\nBasic Statistics:")
print(statistics)

Cleaned DataFrame:
    Name    Age   Salary
0  Alice  24.00  50000.0
1    Bob  27.00  55000.0
2  Carol  25.75  48000.0
3  David  22.00  55750.0
4    Eve  30.00  70000.0

Basic Statistics:
             Age        Salary
count   5.000000      5.000000
mean   25.750000  55750.000000
std     3.031089   8613.216588
min    22.000000  48000.000000
25%    24.000000  50000.000000
50%    25.750000  55000.000000
75%    27.000000  55750.000000
max    30.000000  70000.000000